var jsonObject = {"items": "This is much cooler than you think. Read on!\n\n# BlenderConsolePrompt\n\n[![Join the chat at https://gitter.im/zeffii/BlenderConsolePrompt](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/zeffii/BlenderConsolePrompt?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\n\nBCP is an addon that allows scripts to execute from Blender's Python console (REPL). I have many snippets that don't need a full addon status, but are useful enough that I do want to be able to have fast access to them. The simple `-ls` command shows a list of most common commands, the `-man` command shows a more exhaustive list of stored commands.\n\nThe following commands can be executed straight for the Blender Python console by pressing ctrl+enter after entering the command. You can alter the execute keyboard shortcut by changing it yourself in UserPreferences (or more permanently in the code.. tho I should probably add addonpreferences for this)\n\nAt the moment only one-shot commands are implemented, but future implementations will be modal/interactive and possibly a bpm (Blender package manager).\n\nthese are some of the non modal, one shot commands\n\nCommand String | Description\n-------------- | -------------\ncen | centers 3d cursor\ncenv | centers 3d cursor and aligns all 3d views to it.\ncen=some_value | where some value can be evalled, 3d cursor will be placed at it\nvtx | sees if tinyCAD is enabled and performs VTX, (or first enables it)\nxl (XL) | sees if tinyCAD is enabled and performs XALL, (or first enables it)\nico | sees if developers icons addon is enabled (enables if not) [image](https://cloud.githubusercontent.com/assets/619340/5883599/368909cc-a354-11e4-9a8e-f442ebb8621e.gif)\nwipe | un-links and removes objects, and all meshes\ntt / tb | turntable, trackball\n-debug | downloads / enables index visualizer with polygon bg\nsyntax | sets text editor to syntax highlighting, wrap, linenumber, margin\nstring! | anything followed by an exclamation mark is copied to buffer\nstring?se | search blender.stackexchange for everything infront of the ?\nstring??se | search stackoverflow for everything infront of the ??\nstring?py | search py docs ..\nstring?bpy | search blender bpy docs ..\npsel | make a parent empty for selected objects\n-sel somename | is select=True for all data.objects where `.name.startswith(somename)`\n-gist -o somename | uploads all visible text blocks as a unified github anonymous public gist, then it will open the url in a browser. `-gist -o somename`\n_svc | checking recent sverchok commits (github api) [image](https://github.com/zeffii/BlenderConsolePrompt/issues/3#issuecomment-74256330)\n-man | opens github readme.md for the addon\n\n\n\n\n\n"}